TF apply logs with Debug on

tf apply --auto-approve
2023-04-04T11:10:33.297+0100 [INFO]  Terraform version: 1.4.4
2023-04-04T11:10:33.298+0100 [DEBUG] using github.com/hashicorp/go-tfe v1.18.0
2023-04-04T11:10:33.298+0100 [DEBUG] using github.com/hashicorp/hcl/v2 v2.16.2
2023-04-04T11:10:33.298+0100 [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2023-04-04T11:10:33.298+0100 [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.0
2023-04-04T11:10:33.298+0100 [DEBUG] using github.com/zclconf/go-cty v1.12.1
2023-04-04T11:10:33.298+0100 [INFO]  Go runtime version: go1.19.6
2023-04-04T11:10:33.298+0100 [INFO]  CLI args: []string{"/usr/local/Cellar/tfenv/3.0.0/versions/1.4.4/terraform", "apply", "--auto-approve"}
2023-04-04T11:10:33.298+0100 [DEBUG] Attempting to open CLI config file: /Users/Deepak.Tharanath/.terraformrc
2023-04-04T11:10:33.298+0100 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2023-04-04T11:10:33.298+0100 [INFO]  Loading CLI configuration from /Users/Deepak.Tharanath/.terraform.d/credentials.tfrc.json
2023-04-04T11:10:33.298+0100 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-04-04T11:10:33.298+0100 [DEBUG] ignoring non-existing provider search directory /Users/Deepak.Tharanath/.terraform.d/plugins
2023-04-04T11:10:33.298+0100 [DEBUG] ignoring non-existing provider search directory /Users/Deepak.Tharanath/Library/Application Support/io.terraform/plugins
2023-04-04T11:10:33.298+0100 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2023-04-04T11:10:33.299+0100 [INFO]  CLI command args: []string{"apply", "--auto-approve"}
2023-04-04T11:10:33.302+0100 [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-04-04T11:10:33.879+0100 [DEBUG] Service discovery for app.terraform.io aliased as localterraform.com
2023-04-04T11:10:35.248+0100 [DEBUG] checking for provisioner in "."
2023-04-04T11:10:35.249+0100 [DEBUG] checking for provisioner in "/usr/local/Cellar/tfenv/3.0.0/versions/1.4.4"
2023-04-04T11:10:35.636+0100 [INFO]  cloud: starting Apply operation
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/lbg-cloud-platform/playpen-xcvcef-gcp/runs/run-zxJmMuSG3K7iN7Xa

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
module.log_storage.google_kms_crypto_key.key_stratos_cmek_06: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06/cryptoKeys/stratos-crypto-key-cmek-06]
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_06: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06]
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_01: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01/cryptoKeys/stratos-crypto-key-01/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_07: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_06: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_06: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_07: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07]
module.log_storage.google_kms_crypto_key.key_stratos_01: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01/cryptoKeys/stratos-crypto-key-01]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_05: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_05]
module.log_storage.google_kms_key_ring.keyring_stratos_01: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_04: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_04]
module.log_storage.google_kms_crypto_key.key_stratos_cmek_07: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07]
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_03: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03]
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_06: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06/cryptoKeys/stratos-crypto-key-cmek-06/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_07: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07]
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_07: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_03: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.log_storage.google_kms_crypto_key.key_stratos_cmek_03: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_03: Refreshing state... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_03]
module.log_storage.data.google_logging_project_cmek_settings.cmek_settings: Refreshing...
module.log_storage.data.google_logging_project_cmek_settings.cmek_settings: Still refreshing... [10s elapsed]
module.log_storage.data.google_logging_project_cmek_settings.cmek_settings: Still refreshing... [20s elapsed]
module.log_storage.data.google_logging_project_cmek_settings.cmek_settings: Refresh complete after 25s [id=projects/playpen-xcvcef/cmekSettings]
module.log_storage.google_kms_crypto_key.key_stratos_cmek_07: Drift detected (update)
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_07: Drift detected (update)
2023-04-04T11:11:20.343+0100 [DEBUG] performing request: method=GET url=https://app.terraform.io/api/v2/plans/plan-tYhnaGCMijkZZXz9/json-output-redacted

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.log_storage.google_kms_crypto_key.key_stratos_01 will be destroyed
  # (because google_kms_crypto_key.key_stratos_01 is not in configuration)
  - resource "google_kms_crypto_key" "key_stratos_01" {
      - destroy_scheduled_duration    = "86400s" -> null
      - id                            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01/cryptoKeys/stratos-crypto-key-01" -> null
      - import_only                   = false -> null
      - key_ring                      = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01" -> null
      - labels                        = {} -> null
      - name                          = "stratos-crypto-key-01" -> null
      - purpose                       = "ENCRYPT_DECRYPT" -> null
      - rotation_period               = "100000s" -> null
      - skip_initial_version_creation = false -> null

      - version_template {
          - algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION" -> null
          - protection_level = "SOFTWARE" -> null
        }
    }

  # module.log_storage.google_kms_crypto_key.key_stratos_cmek_03 will be destroyed
  # (because google_kms_crypto_key.key_stratos_cmek_03 is not in configuration)
  - resource "google_kms_crypto_key" "key_stratos_cmek_03" {
      - destroy_scheduled_duration    = "86400s" -> null
      - id                            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03" -> null
      - import_only                   = false -> null
      - key_ring                      = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03" -> null
      - labels                        = {} -> null
      - name                          = "stratos-crypto-key-cmek-03" -> null
      - purpose                       = "ENCRYPT_DECRYPT" -> null
      - rotation_period               = "100000s" -> null
      - skip_initial_version_creation = false -> null

      - version_template {
          - algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION" -> null
          - protection_level = "SOFTWARE" -> null
        }
    }

  # module.log_storage.google_kms_crypto_key.key_stratos_cmek_06 will be destroyed
  # (because google_kms_crypto_key.key_stratos_cmek_06 is not in configuration)
  - resource "google_kms_crypto_key" "key_stratos_cmek_06" {
      - destroy_scheduled_duration    = "86400s" -> null
      - id                            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06/cryptoKeys/stratos-crypto-key-cmek-06" -> null
      - import_only                   = false -> null
      - key_ring                      = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06" -> null
      - labels                        = {} -> null
      - name                          = "stratos-crypto-key-cmek-06" -> null
      - purpose                       = "ENCRYPT_DECRYPT" -> null
      - rotation_period               = "100000s" -> null
      - skip_initial_version_creation = false -> null

      - version_template {
          - algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION" -> null
          - protection_level = "SOFTWARE" -> null
        }
    }

  # module.log_storage.google_kms_crypto_key.key_stratos_cmek_07 will be destroyed
  # (because google_kms_crypto_key.key_stratos_cmek_07 is not in configuration)
  - resource "google_kms_crypto_key" "key_stratos_cmek_07" {
      - destroy_scheduled_duration    = "86400s" -> null
      - id                            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07" -> null
      - import_only                   = false -> null
      - key_ring                      = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07" -> null
      - labels                        = {} -> null
      - name                          = "stratos-crypto-key-cmek-07" -> null
      - purpose                       = "ENCRYPT_DECRYPT" -> null
      - rotation_period               = "100000s" -> null
      - skip_initial_version_creation = false -> null

      - version_template {
          - algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION" -> null
          - protection_level = "SOFTWARE" -> null
        }
    }

  # module.log_storage.google_kms_crypto_key.key_stratos_cmek_08 will be created
  + resource "google_kms_crypto_key" "key_stratos_cmek_08" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "stratos-crypto-key-cmek-08"
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "100000s"
    }

  # module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_01 will be destroyed
  # (because google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_01 is not in configuration)
  - resource "google_kms_crypto_key_iam_binding" "stratos_crypto_key_binding_01" {
      - crypto_key_id = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01/cryptoKeys/stratos-crypto-key-01" -> null
      - etag          = "BwX4bswfWw4=" -> null
      - id            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01/cryptoKeys/stratos-crypto-key-01/roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
      - members       = [
          - "serviceAccount:cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com",
        ] -> null
      - role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
    }

  # module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_03 will be destroyed
  # (because google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_03 is not in configuration)
  - resource "google_kms_crypto_key_iam_binding" "stratos_crypto_key_binding_cmek_03" {
      - crypto_key_id = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03" -> null
      - etag          = "BwX4b/1IV/4=" -> null
      - id            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03/roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
      - members       = [
          - "serviceAccount:cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com",
        ] -> null
      - role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
    }

  # module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_06 will be destroyed
  # (because google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_06 is not in configuration)
  - resource "google_kms_crypto_key_iam_binding" "stratos_crypto_key_binding_cmek_06" {
      - crypto_key_id = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06/cryptoKeys/stratos-crypto-key-cmek-06" -> null
      - etag          = "BwX4f3MJUOc=" -> null
      - id            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06/cryptoKeys/stratos-crypto-key-cmek-06/roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
      - members       = [
          - "serviceAccount:cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com",
        ] -> null
      - role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
    }

  # module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_07 will be destroyed
  # (because google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_07 is not in configuration)
  - resource "google_kms_crypto_key_iam_binding" "stratos_crypto_key_binding_cmek_07" {
      - crypto_key_id = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07" -> null
      - etag          = "BwX4f7OA9gM=" -> null
      - id            = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07/roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
      - members       = [
          - "serviceAccount:cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com",
        ] -> null
      - role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
    }

  # module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_08 will be created
  + resource "google_kms_crypto_key_iam_binding" "stratos_crypto_key_binding_cmek_08" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.log_storage.google_kms_key_ring.keyring_stratos_01 will be destroyed
  # (because google_kms_key_ring.keyring_stratos_01 is not in configuration)
  - resource "google_kms_key_ring" "keyring_stratos_01" {
      - id       = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-01" -> null
      - location = "europe-west2" -> null
      - name     = "stratos-keyring-01" -> null
      - project  = "playpen-xcvcef" -> null
    }

  # module.log_storage.google_kms_key_ring.keyring_stratos_cmek_03 will be destroyed
  # (because google_kms_key_ring.keyring_stratos_cmek_03 is not in configuration)
  - resource "google_kms_key_ring" "keyring_stratos_cmek_03" {
      - id       = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03" -> null
      - location = "europe-west2" -> null
      - name     = "stratos-keyring-cmek-03" -> null
      - project  = "playpen-xcvcef" -> null
    }

  # module.log_storage.google_kms_key_ring.keyring_stratos_cmek_06 will be destroyed
  # (because google_kms_key_ring.keyring_stratos_cmek_06 is not in configuration)
  - resource "google_kms_key_ring" "keyring_stratos_cmek_06" {
      - id       = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-06" -> null
      - location = "europe-west2" -> null
      - name     = "stratos-keyring-cmek-06" -> null
      - project  = "playpen-xcvcef" -> null
    }

  # module.log_storage.google_kms_key_ring.keyring_stratos_cmek_07 will be destroyed
  # (because google_kms_key_ring.keyring_stratos_cmek_07 is not in configuration)
  - resource "google_kms_key_ring" "keyring_stratos_cmek_07" {
      - id       = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07" -> null
      - location = "europe-west2" -> null
      - name     = "stratos-keyring-cmek-07" -> null
      - project  = "playpen-xcvcef" -> null
    }

  # module.log_storage.google_kms_key_ring.keyring_stratos_cmek_08 will be created
  + resource "google_kms_key_ring" "keyring_stratos_cmek_08" {
      + id       = (known after apply)
      + location = "europe-west2"
      + name     = "stratos-keyring-cmek-08"
      + project  = (known after apply)
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket" {
      - bucket_id        = "stratos_log_bucket" -> null
      - enable_analytics = false -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null

      - cmek_settings {
          - kms_key_name         = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring/cryptoKeys/stratos-crypto-key" -> null
          - kms_key_version_name = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring/cryptoKeys/stratos-crypto-key/cryptoKeyVersions/3" -> null
          - service_account_id   = "cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com" -> null
        }
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_03 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_cmek_03 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_cmek_03" {
      - bucket_id        = "stratos_log_bucket_la_cmek_03" -> null
      - enable_analytics = false -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_03" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_03" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 30 -> null

      - cmek_settings {
          - kms_key_name         = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03" -> null
          - kms_key_version_name = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-03/cryptoKeys/stratos-crypto-key-cmek-03/cryptoKeyVersions/1" -> null
          - service_account_id   = "cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com" -> null
        }
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_06 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_cmek_06 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_cmek_06" {
      - bucket_id        = "stratos_log_bucket_la_cmek_06" -> null
      - enable_analytics = true -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_07 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_cmek_07 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_cmek_07" {
      - bucket_id        = "stratos_log_bucket_la_cmek_07" -> null
      - enable_analytics = true -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07" -> null
      - lifecycle_state  = "ACTIVE" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_08 will be created
  + resource "google_logging_project_bucket_config" "stratos_logbucket_cmek_08" {
      + bucket_id       = "stratos_log_bucket_la_cmek_08"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "europe-west2"
      + name            = (known after apply)
      + project         = "playpen-xcvcef"
      + retention_days  = 30

      + cmek_settings {
          + kms_key_name         = (known after apply)
          + kms_key_version_name = (known after apply)
          + name                 = (known after apply)
          + service_account_id   = (known after apply)
        }
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_la is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_la" {
      - bucket_id        = "stratos_log_bucket_la_cmek" -> null
      - enable_analytics = false -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null

      - cmek_settings {
          - kms_key_name         = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-01/cryptoKeys/stratos-crypto-key-cmek-01" -> null
          - kms_key_version_name = "projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-01/cryptoKeys/stratos-crypto-key-cmek-01/cryptoKeyVersions/1" -> null
          - service_account_id   = "cmek-p1098152786644@gcp-sa-logging.iam.gserviceaccount.com" -> null
        }
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_04 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_la_04 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_la_04" {
      - bucket_id        = "stratos_log_bucket_la_cmek_04" -> null
      - enable_analytics = true -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_04" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_04" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_05 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_la_05 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_la_05" {
      - bucket_id        = "stratos_log_bucket_la_cmek_05" -> null
      - enable_analytics = true -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_05" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_05" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_06 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_la_06 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_la_06" {
      - bucket_id        = "stratos_log_bucket_la_cmek_06" -> null
      - enable_analytics = true -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06" -> null
      - lifecycle_state  = "DELETE_REQUESTED" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_07 will be destroyed
  # (because google_logging_project_bucket_config.stratos_logbucket_la_07 is not in configuration)
  - resource "google_logging_project_bucket_config" "stratos_logbucket_la_07" {
      - bucket_id        = "stratos_log_bucket_la_cmek_07" -> null
      - enable_analytics = true -> null
      - id               = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07" -> null
      - lifecycle_state  = "ACTIVE" -> null
      - location         = "europe-west2" -> null
      - name             = "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07" -> null
      - project          = "playpen-xcvcef" -> null
      - retention_days   = 1 -> null
    }

  # module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08 will be created
  + resource "google_logging_project_bucket_config" "stratos_logbucket_la_08" {
      + bucket_id        = "stratos_log_bucket_la_cmek_08"
      + description      = (known after apply)
      + enable_analytics = true
      + id               = (known after apply)
      + lifecycle_state  = (known after apply)
      + location         = "europe-west2"
      + name             = (known after apply)
      + project          = "playpen-xcvcef"
      + retention_days   = 1
    }

Plan: 5 to add, 0 to change, 21 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0

------------------------------------------------------------------------

Organization Policy Check:

============= Results for policy set: policy-library-meta-terraform ============

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

4 policies evaluated.

## Policy 1: policy-library-meta-terraform/deny-restricted-resources (advisory)

Result: true

./deny-restricted-resources.sentinel:73:1 - Rule "main"
  Value:
    true

./deny-restricted-resources.sentinel:69:1 - Rule "are_restricted_resources_defined"
  Description:
    Does the repo define any restricted resources outside of the
    allowed modules

  Value:
    false

## Policy 2: policy-library-meta-terraform/restrict-modules-to-private-registry (advisory)

Result: true

./restrict-modules-to-private-registry.sentinel:54:1 - Rule "main"
  Description:
    Modules must live in our private module registry.

  Value:
    true

## Policy 3: policy-library-meta-terraform/restrict-terraform-version (soft-mandatory)

Result: true

Description:
  The policy uses the tfplan import to enforce the usage of Terraform version  0.12 or higher

./restrict-terraform-version.sentinel:26:1 - Rule "main"
  Description:
    The terraform version number must be compliant

  Value:
    true

## Policy 4: policy-library-meta-terraform/restrict-tf-providers (soft-mandatory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to restrict providers to those  in an allowed list.

./restrict-tf-providers.sentinel:78:1 - Rule "main"
  Description:
    Only terraform providers in the platform allow list can be used

  Value:
    true


====== Results for policy set: policy-library-tfe-project-module-terraform =====

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

2 policies evaluated.

## Policy 1: policy-library-tfe-project-module-terraform/enforce-curated-project-module-use (advisory)

Result: true

./enforce-curated-project-module-use.sentinel:41:1 - Rule "main"
  Value:
    true

## Policy 2: policy-library-tfe-project-module-terraform/enforce-module-version-constraint (soft-mandatory)

Result: true

./enforce-module-version-constraint.sentinel:48:1 - Rule "main"
  Description:
    Main rule

  Value:
    true


===== Results for policy set: policy-library-tfe-workspace-module-terraform ====

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

3 policies evaluated.

## Policy 1: policy-library-tfe-workspace-module-terraform/restrict-workspace-module-version (advisory)

Result: true

./restrict-workspace-module-version.sentinel:39:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 2: policy-library-tfe-workspace-module-terraform/team-access-permissions (advisory)

Result: true

./team-access-permissions.sentinel:10:1 - Rule "main"
  Value:
    true

## Policy 3: policy-library-tfe-workspace-module-terraform/tfe-workspace-modules (advisory)

Result: true

./tfe-workspace-modules.sentinel:14:1 - Rule "main"
  Value:
    true



------------------------------------------------------------------------

module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_05: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_05]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_04: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_04]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_07: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_06: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08: Creating...
module.log_storage.google_logging_project_bucket_config.stratos_logbucket: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_03: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_03]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_07: Destruction complete after 1s
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_07: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_07: Destruction complete after 5s
module.log_storage.google_kms_crypto_key.key_stratos_cmek_07: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07/cryptoKeys/stratos-crypto-key-cmek-07]
module.log_storage.google_kms_crypto_key.key_stratos_cmek_07: Destruction complete after 1s
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_07: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-07]
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_07: Destruction complete after 0s
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_07: Destroying... [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08: Still creating... [10s elapsed]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08: Still creating... [20s elapsed]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08: Still creating... [30s elapsed]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08: Still creating... [40s elapsed]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_la_08: Creation complete after 46s [id=projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_08]
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_08: Creating...
module.log_storage.google_kms_key_ring.keyring_stratos_cmek_08: Creation complete after 1s [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-08]
module.log_storage.google_kms_crypto_key.key_stratos_cmek_08: Creating...
module.log_storage.google_kms_crypto_key.key_stratos_cmek_08: Creation complete after 0s [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-08/cryptoKeys/stratos-crypto-key-cmek-08]
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_08: Creating...
module.log_storage.google_kms_crypto_key_iam_binding.stratos_crypto_key_binding_cmek_08: Creation complete after 6s [id=projects/playpen-xcvcef/locations/europe-west2/keyRings/stratos-keyring-cmek-08/cryptoKeys/stratos-crypto-key-cmek-08/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_08: Creating...
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_07": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_03": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_06": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_04": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_05": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
╷
│ Error: Error updating Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek_08": googleapi: Error 400: This bucket has advanced analytics enabled. CMEK is not compatible with advanced analytics buckets
│
│   with module.log_storage.google_logging_project_bucket_config.stratos_logbucket_cmek_08,
│   on modules/log_storage/main.tf line 34, in resource "google_logging_project_bucket_config" "stratos_logbucket_cmek_08":
│   34: resource "google_logging_project_bucket_config" "stratos_logbucket_cmek_08" {
│
╵
╷
│ Error: Error deleting Logging Bucket Config "projects/playpen-xcvcef/locations/europe-west2/buckets/stratos_log_bucket_la_cmek": googleapi: Error 400: Only buckets in state ACTIVE can be deleted
│
│
╵
Operation failed: failed running terraform apply (exit 1)
